#pragma once

// 定数の定義 ==============================================================

// <システム> ----------------------------------------------------------

#define GAME_TITLE "Sample Game"																			// ゲームタイトル


// <画面> --------------------------------------------------------------

#define SCREEN_RESOLUTION_X			(7.f / 4.f)																// 縦横比 (横)
#define SCREEN_RESOLUTION_Y			(1.f)																	// 縦横比 (縦)
#define SCREEN_FONT_SIZE			(7)																		// 文字の大きさ[pt]




// グローバル変数の宣言 ====================================================





// 関数の宣言 ==============================================================

// 終了リクエスト
void ExitGame(void);
